import Image from 'next/image'
import Link from 'next/link'
import React from 'react'
import { Col , Container , Card , Row } from 'react-bootstrap'

export const Data = [
  { 
    dataslug: "focus-on-unity-and-common-goal-1", 
    dataImg:"/images/slider2.jpg" ,
    dataTitle :"برنامه‌ریزی و استراتژی سرمایه‌گذاری" , 
    dataNotice:"لورم ایپسوم یا طرح‌نما (به انگلیسی: Lorem ipsum) به متنی آزمایشی و بی‌معنی در صنعت چاپ، صفحه‌آرایی و طراحی گرافیک گفته می‌شود. طراح گرافیک از این متن به عنوان عنصری از ترکیب بندی برای پر کردن صفحه و ارایه اولیه شکل ظاهری و کلی طرح سفارش گرفته شده استفاده می نماید، تا از نظر گرافیکی نشانگر چگونگی نوع و اندازه فونت و ظاهر متن باشد.",
    dataText :"معمولا طراحان گرافیک برای صفحه‌آرایی، نخست از متن‌های آزمایشی و بی‌معنی استفاده می‌کنند تا صرفا به مشتری یا صاحب کار خود نشان دهند که صفحه طراحی یا صفحه بندی شده بعد از اینکه متن در آن قرار گیرد چگونه به نظر می‌رسد و قلم‌ها و اندازه‌بندی‌ها چگونه در نظر گرفته شده‌است.",
    dataChart:{
      labels: ['January', 'February', 'March', 'April', 'May', 'June', 'July'],
    value1: [65, 59, 80, 81, 56, 55, 40],
    value2: [28, 48, 40, 19, 86, 27, 10],
    },
    dataDetail: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.",
    dataSubTitle : "مزایای برنامه‌ریزی استراتژیک", 
    dataAdditionalText1: "با برنامه‌ریزی استراتژیک، شما می‌توانید مسیر رشد مالی و حرفه‌ای خود را تعیین کنید و از فرصت‌های سرمایه‌گذاری به بهترین شکل ممکن استفاده کنید.",
    dataAdditionalText2: "این استراتژی به شما کمک می‌کند تا از منابع مالی خود بهره‌برداری بهینه داشته باشید و در مسیر دستیابی به اهداف بلندمدت، تصمیم‌گیری‌های بهتری انجام دهید.",
    dataPie:{
      label: ['item1' , 'item2' , 'item3'],
      value4:[30 , 40 , 30],
      textPie:'با برنامه‌ریزی استراتژیک، شما می‌توانید مسیر رشد مالی و حرفه‌ای خود را تعیین کنید و از فرصت‌های سرمایه‌گذاری به بهترین شکل ممکن استفاده کنید.',
    },
    additionalPoints: [  
      "بهبود مدیریت زمان و منابع",
      "کاهش هزینه‌های غیرضروری",
      "افزایش بهره‌وری در فرآیندها",
      "بهبود مدیریت زمان و منابع",
      "کاهش هزینه‌های غیرضروری",
      "افزایش بهره‌وری در فرآیندها",
      
    ],
    additionalText: "لورم ایپسوم یا طرح‌نما (به انگلیسی: Lorem ipsum) به متنی آزمایشی و بی‌معنی در صنعت چاپ، صفحه‌آرایی و طراحی گرافیک گفته می‌شود. طراح گرافیک از این متن به عنوان عنصری از ترکیب بندی برای پر کردن صفحه و ارایه اولیه شکل ظاهری و کلی طرح سفارش گرفته شده استفاده می نماید، تا از نظر گرافیکی نشانگر چگونگی نوع و اندازه فونت و ظاهر متن باشد.",
    servicequestions : [
      {
        question: "چه خدمات مشاوره مالی ارائه می‌دهید؟",
        answer:
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.",
      },
      {
        question: "خدمات تحلیل بنیادی",
        answer:
          "اژانو به عنوان یکی از فروشگاه های اینترنتی با بیش از یک دهه تجربه، با پایبندی به سه اصل، پرداخت امن و سریع، ۵ روز ضمانت بازگشت کالا و تضمین اصل‌بودن کالا موفق شده تا همگام با فروشگاه‌های معتبر، اعتماد کاربران گرامی را جلب نماید.",
      },
    ]
},
  {
    dataslug: "focus-on-unity-and-common-goal-2", 
    dataImg:"/images/slider3.jpg" ,
    dataTitle :"رویکرد استراتژیک و تجاری" , 
    dataNotice:"لورم ایپسوم یا طرح‌نما (به انگلیسی: Lorem ipsum) به متنی آزمایشی و بی‌معنی در صنعت چاپ، صفحه‌آرایی و طراحی گرافیک گفته می‌شود. طراح گرافیک از این متن به عنوان عنصری از ترکیب بندی برای پر کردن صفحه و ارایه اولیه شکل ظاهری و کلی طرح سفارش گرفته شده استفاده می نماید، تا از نظر گرافیکی نشانگر چگونگی نوع و اندازه فونت و ظاهر متن باشد.",
    dataText :"معمولا طراحان گرافیک برای صفحه‌آرایی، نخست از متن‌های آزمایشی و بی‌معنی استفاده می‌کنند تا صرفا به مشتری یا صاحب کار خود نشان دهند که صفحه طراحی یا صفحه بندی شده بعد از اینکه متن در آن قرار گیرد چگونه به نظر می‌رسد و قلم‌ها و اندازه‌بندی‌ها چگونه در نظر گرفته شده‌است.",
    dataChart: {
      labels: ['January', 'February', 'March', 'April', 'May', 'June', 'July'],
    value1: [65, 59, 80, 81, 56, 55, 40],
    value2: [28, 48, 40, 19, 86, 27, 90],
    },
    dataDetail: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.",
    dataSubTitle : "مزایای برنامه‌ریزی استراتژیک", 
    dataAdditionalText1: "با برنامه‌ریزی استراتژیک، شما می‌توانید مسیر رشد مالی و حرفه‌ای خود را تعیین کنید و از فرصت‌های سرمایه‌گذاری به بهترین شکل ممکن استفاده کنید.",
    dataAdditionalText2: "این استراتژی به شما کمک می‌کند تا از منابع مالی خود بهره‌برداری بهینه داشته باشید و در مسیر دستیابی به اهداف بلندمدت، تصمیم‌گیری‌های بهتری انجام دهید.",
    dataPie:{
      label: ['item1' , 'item2' , 'item3'],
      value4:[30 , 40 , 30], 
      textPie:'با برنامه‌ریزی استراتژیک، شما می‌توانید مسیر رشد مالی و حرفه‌ای خود را تعیین کنید و از فرصت‌های سرمایه‌گذاری به بهترین شکل ممکن استفاده کنید.',
    },
    additionalPoints: [
      "بهبود مدیریت زمان و منابع",
      "کاهش هزینه‌های غیرضروری",
      "افزایش بهره‌وری در فرآیندها",
      "بهبود مدیریت زمان و منابع",
      "کاهش هزینه‌های غیرضروری",
      "افزایش بهره‌وری در فرآیندها",
      
    ],
    additionalText: "با برنامه‌ریزی استراتژیک، به اهداف خود نزدیک‌تر شوید!",
    servicequestions : [
      {
        question: "چه خدمات مشاوره مالی ارائه می‌دهید؟",
        answer:
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.",
      },
      {
        question: "خدمات تحلیل بنیادی",
        answer:
          "اژانو به عنوان یکی از فروشگاه های اینترنتی با بیش از یک دهه تجربه، با پایبندی به سه اصل، پرداخت امن و سریع، ۵ روز ضمانت بازگشت کالا و تضمین اصل‌بودن کالا موفق شده تا همگام با فروشگاه‌های معتبر، اعتماد کاربران گرامی را جلب نماید.",
      },
    ]
},
  {
    dataslug: "focus-on-unity-and-common-goal-3", 
    dataNotice:"لورم ایپسوم یا طرح‌نما (به انگلیسی: Lorem ipsum) به متنی آزمایشی و بی‌معنی در صنعت چاپ، صفحه‌آرایی و طراحی گرافیک گفته می‌شود. طراح گرافیک از این متن به عنوان عنصری از ترکیب بندی برای پر کردن صفحه و ارایه اولیه شکل ظاهری و کلی طرح سفارش گرفته شده استفاده می نماید، تا از نظر گرافیکی نشانگر چگونگی نوع و اندازه فونت و ظاهر متن باشد.",
    dataImg:"/images/img5.jpg" ,
    dataTitle :"زیست‌دارویی و علوم زندگی" , 
    dataText :"معمولا طراحان گرافیک برای صفحه‌آرایی، نخست از متن‌های آزمایشی و بی‌معنی استفاده می‌کنند تا صرفا به مشتری یا صاحب کار خود نشان دهند که صفحه طراحی یا صفحه بندی شده بعد از اینکه متن در آن قرار گیرد چگونه به نظر می‌رسد و قلم‌ها و اندازه‌بندی‌ها چگونه در نظر گرفته شده‌است.",
    dataChart: {
      labels: ['January', 'February', 'March', 'April', 'May', 'June', 'July'],
    value1: [65, 59, 80, 81, 56, 55, 40],
    value2: [28, 48, 40, 19, 86, 27, 90],
    },
    dataDetail: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.",
    dataSubTitle : "مزایای برنامه‌ریزی استراتژیک", 
    dataAdditionalText1: "با برنامه‌ریزی استراتژیک، شما می‌توانید مسیر رشد مالی و حرفه‌ای خود را تعیین کنید و از فرصت‌های سرمایه‌گذاری به بهترین شکل ممکن استفاده کنید.",
    dataAdditionalText2: "این استراتژی به شما کمک می‌کند تا از منابع مالی خود بهره‌برداری بهینه داشته باشید و در مسیر دستیابی به اهداف بلندمدت، تصمیم‌گیری‌های بهتری انجام دهید.",
    dataPie:{
      label: ['item1' , 'item2' , 'item3'],
      value4:[30 , 40 , 30],
      textPie:'با برنامه‌ریزی استراتژیک، شما می‌توانید مسیر رشد مالی و حرفه‌ای خود را تعیین کنید و از فرصت‌های سرمایه‌گذاری به بهترین شکل ممکن استفاده کنید.',
    },
    additionalPoints: [
      "بهبود مدیریت زمان و منابع",
      "کاهش هزینه‌های غیرضروری",
      "افزایش بهره‌وری در فرآیندها",
      "بهبود مدیریت زمان و منابع",
      "کاهش هزینه‌های غیرضروری",
      "افزایش بهره‌وری در فرآیندها",
      
    ],
    additionalText: "با برنامه‌ریزی استراتژیک، به اهداف خود نزدیک‌تر شوید!",
    servicequestions : [
      {
        question: "چه خدمات مشاوره مالی ارائه می‌دهید؟",
        answer:
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.",
      },
      {
        question: "خدمات تحلیل بنیادی",
        answer:
          "اژانو به عنوان یکی از فروشگاه های اینترنتی با بیش از یک دهه تجربه، با پایبندی به سه اصل، پرداخت امن و سریع، ۵ روز ضمانت بازگشت کالا و تضمین اصل‌بودن کالا موفق شده تا همگام با فروشگاه‌های معتبر، اعتماد کاربران گرامی را جلب نماید.",
      },
    ]
},
  {
    dataslug: "focus-on-unity-and-common-goal-4",
    dataNotice:"لورم ایپسوم یا طرح‌نما (به انگلیسی: Lorem ipsum) به متنی آزمایشی و بی‌معنی در صنعت چاپ، صفحه‌آرایی و طراحی گرافیک گفته می‌شود. طراح گرافیک از این متن به عنوان عنصری از ترکیب بندی برای پر کردن صفحه و ارایه اولیه شکل ظاهری و کلی طرح سفارش گرفته شده استفاده می نماید، تا از نظر گرافیکی نشانگر چگونگی نوع و اندازه فونت و ظاهر متن باشد.",
    dataImg:"/images/slider1.jpg" ,
    dataTitle :"فرصت‌های تجاری بین‌المللی" , 
    dataText :"معمولا طراحان گرافیک برای صفحه‌آرایی، نخست از متن‌های آزمایشی و بی‌معنی استفاده می‌کنند تا صرفا به مشتری یا صاحب کار خود نشان دهند که صفحه طراحی یا صفحه بندی شده بعد از اینکه متن در آن قرار گیرد چگونه به نظر می‌رسد و قلم‌ها و اندازه‌بندی‌ها چگونه در نظر گرفته شده‌است.",
    dataChart: {
      labels: ['January', 'February', 'March', 'April', 'May', 'June', 'July'],
    value1: [65, 59, 80, 81, 56, 55, 40],
    value2: [28, 48, 40, 19, 86, 27, 90],
    },
    dataDetail: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.",
    dataSubTitle : "مزایای برنامه‌ریزی استراتژیک", 
    dataAdditionalText1: "با برنامه‌ریزی استراتژیک، شما می‌توانید مسیر رشد مالی و حرفه‌ای خود را تعیین کنید و از فرصت‌های سرمایه‌گذاری به بهترین شکل ممکن استفاده کنید.",
    dataAdditionalText2: "این استراتژی به شما کمک می‌کند تا از منابع مالی خود بهره‌برداری بهینه داشته باشید و در مسیر دستیابی به اهداف بلندمدت، تصمیم‌گیری‌های بهتری انجام دهید.",
    dataPie:{
      label: ['item1' , 'item2' , 'item3'],
      value4:[30 , 40 , 30],
      textPie:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است،',
    },
    additionalPoints: [
      "بهبود مدیریت زمان و منابع",
      "کاهش هزینه‌های غیرضروری",
      "افزایش بهره‌وری در فرآیندها",
      "بهبود مدیریت زمان و منابع",
      "کاهش هزینه‌های غیرضروری",
      "افزایش بهره‌وری در فرآیندها",
      
    ],
    additionalText: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است",
    servicequestions : [
      {
        question: "چه خدمات مشاوره مالی ارائه می‌دهید؟",
        answer:
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.",
      },
      {
        question: "خدمات تحلیل بنیادی",
        answer:
          "اژانو به عنوان یکی از فروشگاه های اینترنتی با بیش از یک دهه تجربه، با پایبندی به سه اصل، پرداخت امن و سریع، ۵ روز ضمانت بازگشت کالا و تضمین اصل‌بودن کالا موفق شده تا همگام با فروشگاه‌های معتبر، اعتماد کاربران گرامی را جلب نماید.",
      },
    ]
},
  {
    dataslug: "focus-on-unity-and-common-goal-5", 
    dataNotice:"لورم ایپسوم یا طرح‌نما (به انگلیسی: Lorem ipsum) به متنی آزمایشی و بی‌معنی در صنعت چاپ، صفحه‌آرایی و طراحی گرافیک گفته می‌شود. طراح گرافیک از این متن به عنوان عنصری از ترکیب بندی برای پر کردن صفحه و ارایه اولیه شکل ظاهری و کلی طرح سفارش گرفته شده استفاده می نماید، تا از نظر گرافیکی نشانگر چگونگی نوع و اندازه فونت و ظاهر متن باشد.",
    dataImg:"/images/slider4.jpg" ,
    dataTitle :"تحقیقات رقابتی و اطمینان‌بخشی" , 
    dataText :"معمولا طراحان گرافیک برای صفحه‌آرایی، نخست از متن‌های آزمایشی و بی‌معنی استفاده می‌کنند تا صرفا به مشتری یا صاحب کار خود نشان دهند که صفحه طراحی یا صفحه بندی شده بعد از اینکه متن در آن قرار گیرد چگونه به نظر می‌رسد و قلم‌ها و اندازه‌بندی‌ها چگونه در نظر گرفته شده‌است.",
    dataChart: {
      labels: ['January', 'February', 'March', 'April', 'May', 'June', 'July'],
    value1: [65, 59, 80, 81, 56, 55, 40],
    value2: [28, 48, 40, 19, 86, 27, 90],
    },
    dataDetail: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.",
    dataSubTitle : "مزایای برنامه‌ریزی استراتژیک", 
    dataAdditionalText1: "با برنامه‌ریزی استراتژیک، شما می‌توانید مسیر رشد مالی و حرفه‌ای خود را تعیین کنید و از فرصت‌های سرمایه‌گذاری به بهترین شکل ممکن استفاده کنید.",
    dataAdditionalText2: "این استراتژی به شما کمک می‌کند تا از منابع مالی خود بهره‌برداری بهینه داشته باشید و در مسیر دستیابی به اهداف بلندمدت، تصمیم‌گیری‌های بهتری انجام دهید.",
    dataPie:{
      label: ['item1' , 'item2' , 'item3'],
      value4:[30 , 40 , 30],
      textPie:'با برنامه‌ریزی استراتژیک، به اهداف خود نزدیک‌تر شوید!',
    },
    additionalPoints: [
      "بهبود مدیریت زمان و منابع",
      "کاهش هزینه‌های غیرضروری",
      "افزایش بهره‌وری در فرآیندها",
    ],
    additionalText: "با برنامه‌ریزی استراتژیک، به اهداف خود نزدیک‌تر شوید!",
    servicequestions : [
      {
        question: "چه خدمات مشاوره مالی ارائه می‌دهید؟",
        answer:
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.",
      },
      {
        question: "خدمات تحلیل بنیادی",
        answer:
          "اژانو به عنوان یکی از فروشگاه های اینترنتی با بیش از یک دهه تجربه، با پایبندی به سه اصل، پرداخت امن و سریع، ۵ روز ضمانت بازگشت کالا و تضمین اصل‌بودن کالا موفق شده تا همگام با فروشگاه‌های معتبر، اعتماد کاربران گرامی را جلب نماید.",
      },
    ]
},
  {
    dataslug: "focus-on-unity-and-common-goal-6", 
    dataImg:"/images/slider5.jpg" ,
    dataNotice:"لورم ایپسوم یا طرح‌نما (به انگلیسی: Lorem ipsum) به متنی آزمایشی و بی‌معنی در صنعت چاپ، صفحه‌آرایی و طراحی گرافیک گفته می‌شود. طراح گرافیک از این متن به عنوان عنصری از ترکیب بندی برای پر کردن صفحه و ارایه اولیه شکل ظاهری و کلی طرح سفارش گرفته شده استفاده می نماید، تا از نظر گرافیکی نشانگر چگونگی نوع و اندازه فونت و ظاهر متن باشد.",
    dataTitle :"پاسخ‌ها و راه‌حل‌های ساده برای کسب‌و‌کار" , 
    dataText :"معمولا طراحان گرافیک برای صفحه‌آرایی، نخست از متن‌های آزمایشی و بی‌معنی استفاده می‌کنند تا صرفا به مشتری یا صاحب کار خود نشان دهند که صفحه طراحی یا صفحه بندی شده بعد از اینکه متن در آن قرار گیرد چگونه به نظر می‌رسد و قلم‌ها و اندازه‌بندی‌ها چگونه در نظر گرفته شده‌است.",
    dataChart: {
    labels: ['January', 'February', 'March', 'April', 'May', 'June', 'July'],
    value1: [65, 59, 80, 81, 56, 55, 40],
    value2: [28, 48, 40, 19, 86, 27, 90],
    },
    dataDetail: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.",
    dataSubTitle : "مزایای برنامه‌ریزی استراتژیک", 
    dataAdditionalText1: "با برنامه‌ریزی استراتژیک، شما می‌توانید مسیر رشد مالی و حرفه‌ای خود را تعیین کنید و از فرصت‌های سرمایه‌گذاری به بهترین شکل ممکن استفاده کنید.",
    dataAdditionalText2: "این استراتژی به شما کمک می‌کند تا از منابع مالی خود بهره‌برداری بهینه داشته باشید و در مسیر دستیابی به اهداف بلندمدت، تصمیم‌گیری‌های بهتری انجام دهید.",
    dataPie:{
      label: ['item1' , 'item2' , 'item3'],
      value4:[30 , 40 , 30],
      textPie:'.لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.',
    },
    additionalPoints: [
      "بهبود مدیریت زمان و منابع",
      "کاهش هزینه‌های غیرضروری",
      "افزایش بهره‌وری در فرآیندها",
    ],
    additionalText: "با برنامه‌ریزی استراتژیک، به اهداف خود نزدیک‌تر شوید!",
    servicequestions : [
      {
        question: "چه خدمات مشاوره مالی ارائه می‌دهید؟",
        answer:
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.",
      },
      {
        question: "خدمات تحلیل بنیادی",
        answer:
          "اژانو به عنوان یکی از فروشگاه های اینترنتی با بیش از یک دهه تجربه، با پایبندی به سه اصل، پرداخت امن و سریع، ۵ روز ضمانت بازگشت کالا و تضمین اصل‌بودن کالا موفق شده تا همگام با فروشگاه‌های معتبر، اعتماد کاربران گرامی را جلب نماید.",
      },
    ]
},
  {
    dataslug: "focus-on-unity-and-common-goal-7", 
    dataNotice:"لورم ایپسوم یا طرح‌نما (به انگلیسی: Lorem ipsum) به متنی آزمایشی و بی‌معنی در صنعت چاپ، صفحه‌آرایی و طراحی گرافیک گفته می‌شود. طراح گرافیک از این متن به عنوان عنصری از ترکیب بندی برای پر کردن صفحه و ارایه اولیه شکل ظاهری و کلی طرح سفارش گرفته شده استفاده می نماید، تا از نظر گرافیکی نشانگر چگونگی نوع و اندازه فونت و ظاهر متن باشد.",
    dataImg:"/images/11.jpg" ,
    dataTitle :"رویکرد استراتژیک و تجاری" , 
    dataText :"معمولا طراحان گرافیک برای صفحه‌آرایی، نخست از متن‌های آزمایشی و بی‌معنی استفاده می‌کنند تا صرفا به مشتری یا صاحب کار خود نشان دهند که صفحه طراحی یا صفحه بندی شده بعد از اینکه متن در آن قرار گیرد چگونه به نظر می‌رسد و قلم‌ها و اندازه‌بندی‌ها چگونه در نظر گرفته شده‌است.",
    dataChart: {
      labels: ['January', 'February', 'March', 'April', 'May', 'June', 'July'],
      value1: [65, 59, 80, 81, 56, 55, 40],
      value2: [28, 48, 40, 19, 86, 27, 90],
    },
    dataDetail: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.",
    dataSubTitle : "مزایای برنامه‌ریزی استراتژیک", 
    dataAdditionalText1: "با برنامه‌ریزی استراتژیک، شما می‌توانید مسیر رشد مالی و حرفه‌ای خود را تعیین کنید و از فرصت‌های سرمایه‌گذاری به بهترین شکل ممکن استفاده کنید.",
    dataAdditionalText2: "این استراتژی به شما کمک می‌کند تا از منابع مالی خود بهره‌برداری بهینه داشته باشید و در مسیر دستیابی به اهداف بلندمدت، تصمیم‌گیری‌های بهتری انجام دهید.",
    dataPie:{
      label: ['item1' , 'item2' , 'item3'],
      value4:[30 , 40 , 30],
      textPie:'.لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.',
    },
    additionalPoints: [
      "بهبود مدیریت زمان و منابع",
      "کاهش هزینه‌های غیرضروری",
      "افزایش بهره‌وری در فرآیندها",
    ],
    additionalText: "با برنامه‌ریزی استراتژیک، به اهداف خود نزدیک‌تر شوید!", 
    servicequestions : [
      {
        question: "چه خدمات مشاوره مالی ارائه می‌دهید؟",
        answer:
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.",
      },
      {
        question: "خدمات تحلیل بنیادی",
        answer:
          "اژانو به عنوان یکی از فروشگاه های اینترنتی با بیش از یک دهه تجربه، با پایبندی به سه اصل، پرداخت امن و سریع، ۵ روز ضمانت بازگشت کالا و تضمین اصل‌بودن کالا موفق شده تا همگام با فروشگاه‌های معتبر، اعتماد کاربران گرامی را جلب نماید.",
      },
    ]
},
  {
    dataslug: "focus-on-unity-and-common-goal-8", 
    dataNotice:"لورم ایپسوم یا طرح‌نما (به انگلیسی: Lorem ipsum) به متنی آزمایشی و بی‌معنی در صنعت چاپ، صفحه‌آرایی و طراحی گرافیک گفته می‌شود. طراح گرافیک از این متن به عنوان عنصری از ترکیب بندی برای پر کردن صفحه و ارایه اولیه شکل ظاهری و کلی طرح سفارش گرفته شده استفاده می نماید، تا از نظر گرافیکی نشانگر چگونگی نوع و اندازه فونت و ظاهر متن باشد.",
    dataImg:"/images/slider6.jpg" ,
    dataTitle :"فرصت‌های تجاری بین‌المللی" , 
    dataText :"معمولا طراحان گرافیک برای صفحه‌آرایی، نخست از متن‌های آزمایشی و بی‌معنی استفاده می‌کنند تا صرفا به مشتری یا صاحب کار خود نشان دهند که صفحه طراحی یا صفحه بندی شده بعد از اینکه متن در آن قرار گیرد چگونه به نظر می‌رسد و قلم‌ها و اندازه‌بندی‌ها چگونه در نظر گرفته شده‌است.",
    dataChart: {
      labels: ['January', 'February', 'March', 'April', 'May', 'June', 'July'],
    value1: [65, 59, 80, 81, 56, 55, 40],
    value2: [28, 48, 40, 19, 86, 27, 10],
    },
    dataDetail: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.",
    dataSubTitle : "مزایای برنامه‌ریزی استراتژیک", 
    dataAdditionalText1: "با برنامه‌ریزی استراتژیک، شما می‌توانید مسیر رشد مالی و حرفه‌ای خود را تعیین کنید و از فرصت‌های سرمایه‌گذاری به بهترین شکل ممکن استفاده کنید.",
    dataAdditionalText2: "این استراتژی به شما کمک می‌کند تا از منابع مالی خود بهره‌برداری بهینه داشته باشید و در مسیر دستیابی به اهداف بلندمدت، تصمیم‌گیری‌های بهتری انجام دهید.",
    dataPie:{
      label: ['item1' , 'item2' , 'item3'],
      value4:[30 , 40 , 30],
      textPie:'.لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.',
    },
    additionalPoints: [
      "بهبود مدیریت زمان و منابع",
      "کاهش هزینه‌های غیرضروری",
      "افزایش بهره‌وری در فرآیندها",
    ],
    additionalText: "با برنامه‌ریزی استراتژیک، به اهداف خود نزدیک‌تر شوید!",
    servicequestions : [
      {
        question: "چه خدمات مشاوره مالی ارائه می‌دهید؟",
        answer:
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.",
      },
      {
        question: "خدمات تحلیل بنیادی",
        answer:
          "اژانو به عنوان یکی از فروشگاه های اینترنتی با بیش از یک دهه تجربه، با پایبندی به سه اصل، پرداخت امن و سریع، ۵ روز ضمانت بازگشت کالا و تضمین اصل‌بودن کالا موفق شده تا همگام با فروشگاه‌های معتبر، اعتماد کاربران گرامی را جلب نماید.",
      },
    ]
},
  {
    dataslug: "focus-on-unity-and-common-goal-9", 
    dataNotice:"لورم ایپسوم یا طرح‌نما (به انگلیسی: Lorem ipsum) به متنی آزمایشی و بی‌معنی در صنعت چاپ، صفحه‌آرایی و طراحی گرافیک گفته می‌شود. طراح گرافیک از این متن به عنوان عنصری از ترکیب بندی برای پر کردن صفحه و ارایه اولیه شکل ظاهری و کلی طرح سفارش گرفته شده استفاده می نماید، تا از نظر گرافیکی نشانگر چگونگی نوع و اندازه فونت و ظاهر متن باشد.",
    dataImg:"/images/img6.jpg" ,
    dataTitle :"برنامه‌ریزی و استراتژی سرمایه‌گذاری" , 
    dataText :"معمولا طراحان گرافیک برای صفحه‌آرایی، نخست از متن‌های آزمایشی و بی‌معنی استفاده می‌کنند تا صرفا به مشتری یا صاحب کار خود نشان دهند که صفحه طراحی یا صفحه بندی شده بعد از اینکه متن در آن قرار گیرد چگونه به نظر می‌رسد و قلم‌ها و اندازه‌بندی‌ها چگونه در نظر گرفته شده‌است.",
    dataChart: {
      labels: ['January', 'February', 'March', 'April', 'May', 'June', 'July'],
    value1: [65, 59, 80, 81, 56, 55, 40],
    value2: [28, 48, 40, 19, 86, 27, 10],
    },
    dataDetail: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.",
    dataSubTitle : "مزایای برنامه‌ریزی استراتژیک", 
    dataAdditionalText1: "با برنامه‌ریزی استراتژیک، شما می‌توانید مسیر رشد مالی و حرفه‌ای خود را تعیین کنید و از فرصت‌های سرمایه‌گذاری به بهترین شکل ممکن استفاده کنید.",
    dataAdditionalText2: "این استراتژی به شما کمک می‌کند تا از منابع مالی خود بهره‌برداری بهینه داشته باشید و در مسیر دستیابی به اهداف بلندمدت، تصمیم‌گیری‌های بهتری انجام دهید.",
    dataPie:{
      label: ['item1' , 'item2' , 'item3'],
      value4:[30 , 40 , 30],
      textPie:'.لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.',
    },
    additionalPoints: [
      "بهبود مدیریت زمان و منابع",
      "کاهش هزینه‌های غیرضروری",
      "افزایش بهره‌وری در فرآیندها",
    ],
    additionalText: "با برنامه‌ریزی استراتژیک، به اهداف خود نزدیک‌تر شوید!",
    servicequestions : [
      {
        question: "چه خدمات مشاوره مالی ارائه می‌دهید؟",
        answer:
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.",
      },
      {
        question: "خدمات تحلیل بنیادی",
        answer:
          "اژانو به عنوان یکی از فروشگاه های اینترنتی با بیش از یک دهه تجربه، با پایبندی به سه اصل، پرداخت امن و سریع، ۵ روز ضمانت بازگشت کالا و تضمین اصل‌بودن کالا موفق شده تا همگام با فروشگاه‌های معتبر، اعتماد کاربران گرامی را جلب نماید.",
      },
    ]
},
];

// تابع برای دریافت تمام داده‌ها
export const getAllData = async () => { 
  return Data;
};

// تابع برای دریافت داده بر اساس slug
export const getDataBySlug = async (dataslug) => {
  return Data.find((item) => item.dataslug === dataslug);
};

const ServicesData = () => {
  return (
    <Container className="px-0">
      <Row className="d-flex">
        {Data.map((cardData, index) => (
          <Col 
            key={index} lg={4}  md={4}  sm={6}  xs={12} className="pb-4 pt-5" >
            <Link  href={`/service/${cardData.dataslug}`} passHref className="text-decoration-none services-link">
              <Card className="h-100">
                <Image 
                  src={cardData.dataImg}
                  width="300"
                  height="280"
                  alt={cardData.dataTitle} 
                  className="services-img" 
                />
                <Card.Body className="pb-4 mx-2 data-card">
                  <h6 className="py-3 fw-bold text-line-height">
                    {cardData.dataTitle}
                  </h6>
                  <Card.Text className="text-font text-line-height">
                    {cardData.dataText}
                  </Card.Text>
                </Card.Body>
              </Card>
            </Link>
          </Col>
        ))}
      </Row>
    </Container>
  )
}
 export async function getStaticProps() {
    // در اینجا می‌توانید از `getAllPosts` استفاده کنید
    const Data = await getAllData();
    return {
      props: { Data },
    };
  }

export default ServicesData