import Image from 'next/image'
import Link from 'next/link'
import React from 'react'
import { Col , Container , Card , CardBody , CardText , Row } from 'react-bootstrap'

const Data = [
  {
    dataImg:"/images/slider2.jpg" ,
    dataTitle :"برنامه‌ریزی و استراتژی سرمایه‌گذاری" , 
    dataText :"معمولا طراحان گرافیک برای صفحه‌آرایی، نخست از متن‌های آزمایشی و بی‌معنی استفاده می‌کنند تا صرفا به مشتری یا صاحب کار خود نشان دهند که صفحه طراحی یا صفحه بندی شده بعد از اینکه متن در آن قرار گیرد چگونه به نظر می‌رسد و قلم‌ها و اندازه‌بندی‌ها چگونه در نظر گرفته شده‌است."
  },
  {
    dataImg:"/images/slider3.jpg" ,
    dataTitle :"رویکرد استراتژیک و تجاری" , 
    dataText :"معمولا طراحان گرافیک برای صفحه‌آرایی، نخست از متن‌های آزمایشی و بی‌معنی استفاده می‌کنند تا صرفا به مشتری یا صاحب کار خود نشان دهند که صفحه طراحی یا صفحه بندی شده بعد از اینکه متن در آن قرار گیرد چگونه به نظر می‌رسد و قلم‌ها و اندازه‌بندی‌ها چگونه در نظر گرفته شده‌است."
  },
  {
    dataImg:"/images/img5.jpg" ,
    dataTitle :"زیست‌دارویی و علوم زندگی" , 
    dataText :"معمولا طراحان گرافیک برای صفحه‌آرایی، نخست از متن‌های آزمایشی و بی‌معنی استفاده می‌کنند تا صرفا به مشتری یا صاحب کار خود نشان دهند که صفحه طراحی یا صفحه بندی شده بعد از اینکه متن در آن قرار گیرد چگونه به نظر می‌رسد و قلم‌ها و اندازه‌بندی‌ها چگونه در نظر گرفته شده‌است."
  },
  {
    dataImg:"/images/slider1.jpg" ,
    dataTitle :"فرصت‌های تجاری بین‌المللی" , 
    dataText :"معمولا طراحان گرافیک برای صفحه‌آرایی، نخست از متن‌های آزمایشی و بی‌معنی استفاده می‌کنند تا صرفا به مشتری یا صاحب کار خود نشان دهند که صفحه طراحی یا صفحه بندی شده بعد از اینکه متن در آن قرار گیرد چگونه به نظر می‌رسد و قلم‌ها و اندازه‌بندی‌ها چگونه در نظر گرفته شده‌است."
  },
  {
    dataImg:"/images/slider4.jpg" ,
    dataTitle :"تحقیقات رقابتی و اطمینان‌بخشی" , 
    dataText :"معمولا طراحان گرافیک برای صفحه‌آرایی، نخست از متن‌های آزمایشی و بی‌معنی استفاده می‌کنند تا صرفا به مشتری یا صاحب کار خود نشان دهند که صفحه طراحی یا صفحه بندی شده بعد از اینکه متن در آن قرار گیرد چگونه به نظر می‌رسد و قلم‌ها و اندازه‌بندی‌ها چگونه در نظر گرفته شده‌است."
  },
  {
    dataImg:"/images/slider5.jpg" ,
    dataTitle :"پاسخ‌ها و راه‌حل‌های ساده برای کسب‌و‌کار" , 
    dataText :"معمولا طراحان گرافیک برای صفحه‌آرایی، نخست از متن‌های آزمایشی و بی‌معنی استفاده می‌کنند تا صرفا به مشتری یا صاحب کار خود نشان دهند که صفحه طراحی یا صفحه بندی شده بعد از اینکه متن در آن قرار گیرد چگونه به نظر می‌رسد و قلم‌ها و اندازه‌بندی‌ها چگونه در نظر گرفته شده‌است."
  },
  {
    dataImg:"/images/11.jpg" ,
    dataTitle :"رویکرد استراتژیک و تجاری" , 
    dataText :"معمولا طراحان گرافیک برای صفحه‌آرایی، نخست از متن‌های آزمایشی و بی‌معنی استفاده می‌کنند تا صرفا به مشتری یا صاحب کار خود نشان دهند که صفحه طراحی یا صفحه بندی شده بعد از اینکه متن در آن قرار گیرد چگونه به نظر می‌رسد و قلم‌ها و اندازه‌بندی‌ها چگونه در نظر گرفته شده‌است."
  },
  {
    dataImg:"/images/slider6.jpg" ,
    dataTitle :"فرصت‌های تجاری بین‌المللی" , 
    dataText :"معمولا طراحان گرافیک برای صفحه‌آرایی، نخست از متن‌های آزمایشی و بی‌معنی استفاده می‌کنند تا صرفا به مشتری یا صاحب کار خود نشان دهند که صفحه طراحی یا صفحه بندی شده بعد از اینکه متن در آن قرار گیرد چگونه به نظر می‌رسد و قلم‌ها و اندازه‌بندی‌ها چگونه در نظر گرفته شده‌است."
  },
  {
    dataImg:"/images/img6.jpg" ,
    dataTitle :"برنامه‌ریزی و استراتژی سرمایه‌گذاری" , 
    dataText :"معمولا طراحان گرافیک برای صفحه‌آرایی، نخست از متن‌های آزمایشی و بی‌معنی استفاده می‌کنند تا صرفا به مشتری یا صاحب کار خود نشان دهند که صفحه طراحی یا صفحه بندی شده بعد از اینکه متن در آن قرار گیرد چگونه به نظر می‌رسد و قلم‌ها و اندازه‌بندی‌ها چگونه در نظر گرفته شده‌است."
  },
]
const ServicesData = () => {
  return (
    <Container className="px-0">
      <Row className="d-flex">
        {Data.map((cardData, index) => (
          <Col 
            key={index} lg={4}  md={4}  sm={6}  xs={12} className="pb-4 pt-5" >
            <Link href="/" passHref className="text-decoration-none services-link">
              <Card className="h-100">
                <Image 
                  src={cardData.dataImg}
                  width="300"
                  height="280"
                  alt={cardData.dataTitle} 
                  className="services-img" 
                />
                <Card.Body className="pb-4 mx-2 data-card">
                  <h6 className="py-3 fw-bold text-line-height">
                    {cardData.dataTitle}
                  </h6>
                  <Card.Text className="text-font text-line-height">
                    {cardData.dataText}
                  </Card.Text>
                </Card.Body>
              </Card>
            </Link>
          </Col>
        ))}
      </Row>
    </Container>
  )
}

export default ServicesData